     A                                      UNIQUE
     A          R ITMMASTR
     A            ITNUM          5S 0
     A            ITDESC        30A
     A            ITQTY          5S 0
     A            ITPRICE        5S 0
     A            CRUSR         10A
     A            CRDATE          Z
     A            CRPGM         10A
     A            UPUSR         10A
     A            UPDATE          Z
     A            UPPGM         10A
     A          K ITNUM
